xyyniudehen/STM32-FreeRTOS-Watch/hardware/MyI2C.c
#include "stm32f10x.h"                  // Device header
#include "Delay.h"

static void MyI2C_Delay(void)
{
    volatile uint32_t i = 120;

    while (i--)
    {
        __NOP();
    }
}

void MyI2C_W_SCL(uint8_t BitValue)
{
    GPIO_WriteBit(GPIOB, GPIO_Pin_10, (BitAction)BitValue);
    MyI2C_Delay();
}
void MyI2C_W_SDA(uint8_t BitValue)
{
    GPIO_WriteBit(GPIOB, GPIO_Pin_11, (BitAction)BitValue);
    MyI2C_Delay();
}
uint8_t MyI2C_R_SDA(void)
{
    uint8_t BitValue;
    BitValue = GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_11);
    MyI2C_Delay();
    return BitValue;
}

void MyI2C_Init(void)
{
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB,ENABLE);
	GPIO_InitTypeDef Init_structure_GPIO;
	Init_structure_GPIO.GPIO_Mode = GPIO_Mode_Out_OD;
	Init_structure_GPIO.GPIO_Pin = GPIO_Pin_10|GPIO_Pin_11 ;
	Init_structure_GPIO.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB,&Init_structure_GPIO);

    GPIO_SetBits(GPIOB, GPIO_Pin_10|GPIO_Pin_11);
}

void MyI2C_Start(void)
{   
    MyI2C_W_SDA(1);
    MyI2C_W_SCL(1);
    MyI2C_W_SDA(0);
    MyI2C_W_SCL(0);

}

void MyI2C_Stop(void)
{
    MyI2C_W_SDA(0);
    MyI2C_W_SCL(1);
    MyI2C_W_SDA(1);

}

void MyI2C_SendByte(uint8_t Byte)
{
    uint8_t i;
    for (i=0; i<8; i++)
    {
    MyI2C_W_SDA(!!(Byte & (0x80 >> i)));
    MyI2C_W_SCL(1);
    MyI2C_W_SCL(0);
    }

}

uint8_t MyI2C_ReceiveByte(void)
{
    uint8_t i, Byte=0x00;
    MyI2C_W_SDA(1);
    for (i=0; i<8; i++)
    {
    MyI2C_W_SCL(1);
    if (MyI2C_R_SDA())
    {
        Byte |= (0X80>>i);
    }
    MyI2C_W_SCL(0);
    }
    return Byte;

}


void MyI2C_SendACK(uint8_t ACKBit)
{
    MyI2C_W_SDA(ACKBit);
    MyI2C_W_SCL(1);
    MyI2C_W_SCL(0);

}

uint8_t MyI2C_ReceiveACK(void)
{
    uint8_t  ACKBit;
    MyI2C_W_SDA(1);
    MyI2C_W_SCL(1);
    ACKBit =MyI2C_R_SDA();
    MyI2C_W_SCL(0);
    return ACKBit;

}